app/views/shared/_footer.html.erb

SELECT "insta_images".* FROM "insta_images"
---
          <div class="row">
            <% @insta = InstaImage.all %>