app/controllers/beers_controller.rb

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1
---
  def show
    @beer = Beer.find(params[:id])

INSERT INTO "beers" ("name", "style", "abv", "ibu", "color", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @beer = Beer.create(beer_params)

SELECT  "beers".* FROM "beers" WHERE (style LIKE ('French Saison') and id <> (6)) LIMIT 3
---
  def related_beer(beer)
    Beer.where("style LIKE (?) and id <> (?)", beer.style, beer.id).take(3)