app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."beer_id" = ? AND "images"."id" = ? LIMIT 1  [["beer_id", 1], ["id", 2]]
---
  def show
    @image = @beer.images.find(params[:id])

INSERT INTO "images" ("title", "background_image", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Tree"], ["background_image", "f"], ["beer_id", 1], ["created_at", "2016-01-03 23:57:01.202536"], ["updated_at", "2016-01-03 23:57:01.202536"]]
---
  def create
    @image = @beer.images.create(image_params)

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_beer
    @beer = Beer.find(params[:beer_id])