app/models/event.rb

SELECT  "events".* FROM "events" WHERE (event_date_time > '2016-02-15 23:55:14.820095') LIMIT 3
---
   def self.upcoming_events
     Event.where('event_date_time > ?', Time.now).take(3)